import pytest

from utils.RegionListMixin import RegionListMixin
from utils.VisitedCityMixin import VisitedCityMixin


@pytest.mark.parametrize(
    'num, word', (
        (1, 'регион'),
        (2, 'региона'),
        (3, 'региона'),
        (4, 'региона'),
        (5, 'регионов'),
        (6, 'регионов'),
        (7, 'регионов'),
        (8, 'регионов'),
        (9, 'регионов'),
        (10, 'регионов'),
        (11, 'регионов'),
        (12, 'регионов'),
        (13, 'регионов'),
        (14, 'регионов'),
        (15, 'регионов'),
        (16, 'регионов'),
        (17, 'регионов'),
        (18, 'регионов'),
        (19, 'регионов'),
        (20, 'регионов'),
        (21, 'регион'),
        (22, 'региона'),
        (31, 'регион'),
        (33, 'региона'),
        (44, 'региона'),
        (55, 'регионов'),
        (66, 'регионов'),
        (77, 'регионов'),
        (88, 'регионов'),
        (99, 'регионов'),
        (100, 'регионов')
    )
)
def test__declension_of_city(quantity, word):
    mixin = RegionListMixin()

    assert mixin.declension_of_region(quantity) == word


@pytest.mark.parametrize(
    'num, word', (
        (1, 'Посещён'),
        (2, 'Посещено'),
        (3, 'Посещено'),
        (4, 'Посещено'),
        (5, 'Посещено'),
        (6, 'Посещено'),
        (7, 'Посещено'),
        (8, 'Посещено'),
        (9, 'Посещено'),
        (10, 'Посещено'),
        (11, 'Посещено'),
        (12, 'Посещено'),
        (13, 'Посещено'),
        (14, 'Посещено'),
        (15, 'Посещено'),
        (16, 'Посещено'),
        (17, 'Посещено'),
        (18, 'Посещено'),
        (19, 'Посещено'),
        (20, 'Посещено'),
        (21, 'Посещён'),
        (22, 'Посещено'),
        (33, 'Посещено'),
        (44, 'Посещено'),
        (55, 'Посещено'),
        (66, 'Посещено'),
        (77, 'Посещено'),
        (88, 'Посещено'),
        (99, 'Посещено'),
    )
)
def test__declension_of_visited(quantity, word):
    mixin = VisitedCityMixin()

    assert mixin.declension_of_visited(quantity) == word
